docs/index.html
<!doctype html>
<html lang="en">
<head>
<title>index</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="fh">
<link  href="./assets/bootstrap.min.css" rel="stylesheet"></head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">index</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">sort</h2>
<div class="outline-text-2" id="text-1">
<p>
DDos protection by cloudflare<br >
</p>

<pre class="example">
du -h -d1 . | grep '[0-9\,]\+G'
ls -l --block-size=M
find ./*/builds/*/results -type f -name '*' -exec rm {} +
find ./*/builds -type d -name '*' -exec rm -rf {} +
find . -type d -name builds -exec rm -rf {} +
</pre>

<p>
code drip<br >
 &#x2013; levels.fyi<br >
 &#x2013; indiehackers.com<br >
 &#x2013; levels.io<br >
 &#x2013; toptal.com<br >
</p>

<p>
Font: Google Rubik <a href="https://fonts.google.com/specimen/Rubik">fonts.google.com</a><br >
as seen for example on <a href="https://www.rockpapershotgun.com/2019/06/14/cyberpunk-2077s-in-game-context-doesnt-matter-if-its-marketing-contributes-to-transphobia-right-now/">rockpapershotgun.com</a><br >
</p>

<p>
for unicode characters <a href="https://graphemica.com/search?q=file">graphemica.com</a><br >
</p>


<p>
<a href="https://github.com/ElliotPenson/org">https://github.com/ElliotPenson/org</a>,<br >
<a href="http://jgkamat.gitlab.io/blog/website1.html">http://jgkamat.gitlab.io/blog/website1.html</a><br >
</p>

<p>
still think about bookstack<br >
still think about <a href="https://www.getoutline.com/">https://www.getoutline.com/</a><br >
</p>

<p>
resources: <a href="https://www.reddit.com/r/emacs/comments/5mff61/anyone_got_any_good_advanced_orgmode_resources/">r/emacs</a><br >
</p>

<p>
<a href="https://www.reddit.com/r/devops/comments/8mhju4/best_online_source_to_learn_devops_tools/">r/devops</a><br >
<a href="https://roadmap.sh/guides/what-is-internet">https://roadmap.sh/guides/what-is-internet</a><br >
</p>

<p>
<a href="https://sp18.datastructur.es/">https://sp18.datastructur.es/</a>, <a href="https://www.reddit.com/r/learnprogramming/comments/8mdlb9/what_online_courses_are_100_entirely_worth_it/">reddit.com</a><br >
</p>

<p>
<a href="https://www.reddit.com/r/linuxadmin/comments/65vb8s/advice_if_you_are_wanting_to_go_into_devops/">r/linuxadmin</a><br >
</p>

<p>
service mesh <a href="https://buoyant.io/2017/04/25/whats-a-service-mesh-and-why-do-i-need-one/">buoyant.io</a><br >
</p>


<pre class="example">
docker compile -v 
</pre>
<p>
should be in quotation marks "" (see PUGpresent)<br >
</p>


<p>
DNS can be simple load balancer (round robin)<br >
</p>

<p>
Why I pick Heroku over AWS Lambda. But not always. <a href="https://blog.checklyhq.com/why-i-pick-heroku-over-aws-lambda-but-not-always/">blog.checklyhq.com</a><br >
</p>

<p>
course <a href="https://cloudacademy.com/learning-paths/building-and-deploying-a-cloud-native-application-796/">cloudacademy.com</a><br >
</p>

<p>
<a href="https://medium.com/@giltayar/testing-your-frontend-code-part-i-introduction-7e307eac4446">https://medium.com/@giltayar/testing-your-frontend-code-part-i-introduction-7e307eac4446</a><br >
</p>
</div>
</div>




<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">learn</h2>
<div class="outline-text-2" id="text-2">
<p>
checksum, sha512, SMTP, FTP, SSH, HTTP, /dev/null<br >
virtual console vs. terminal, CDN, POSIX<br >
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">dev</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="dev/git.html">git</a>, <a href="dev/GitHub.html">GitHub</a><br >
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">ops</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="ops/docker.html">docker</a> <br >
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">lang</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="lang/general.html">general</a>, <a href="lang/bash.html">bash</a>, <a href="lang/python.html">python</a>, <a href="lang/js.html">js</a>, <a href="lang/html.html">html</a>, <a href="lang/css.html">css</a><br >
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">opt</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="opt/linux.html">linux</a>, <a href="opt/emacs.html">emacs</a>, <a href="opt/rsync.html">rsync</a><br >
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">org</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="org/agile.html">agile</a><br >
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">data science</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="data/visualization.html">visualization</a>,<br >
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">test</h2>
<div class="outline-text-2" id="text-9">
<p>
<a href="test/test_article.html">test article</a><br >
</p>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">sort</a></li>
<li><a href="#sec-2">learn</a></li>
<li><a href="#sec-3">dev</a></li>
<li><a href="#sec-4">ops</a></li>
<li><a href="#sec-5">lang</a></li>
<li><a href="#sec-6">opt</a></li>
<li><a href="#sec-7">org</a></li>
<li><a href="#sec-8">data science</a></li>
<li><a href="#sec-9">test</a></li>
</ul>
</div>
</nav>
</div></div></div>
</body>
</html>
